//ДОМАШНЄ ЗАВДАННЯ
//1
//Курс: ПЛАТФОРМА MICROSOFT .NET ТА МОВА
//ПРОГРАМУВАННЯ C#
//Тема: Вступ до LINQ
//Для вирішення завдань використовуйте синтаксис запитів LINQ.


//Завдання 1:
//Згенеруйте колекцію цілих чисел та реалізуйте наступні запити:
//-Вивести весь масив цілих.
//- Вивести на екран тільки парні цілі
//- Отримати непарні цілі.
//- Отримати числа в заданому діапазоні.
//- Отримати числа, кратні семи та відсортувати.
//- Отримати числа, кратні восьми. Результат відсортуйте за
//спаданням.


//Завдання 2:
//Для масиву рядків з назвою міст, реалізуйте наступні запити:
//-Отримати весь масив міст.
//- Отримати міста з довжиною назви, що дорівнює заданому.
//- Отримати міста, назви яких починаються з літери A.
//- Отримати міста, назви яких закінчуються літерою M.
//- Отримати міста, назви яких починаються з літери N і
//закінчуються літерою K


//Завдання 3:
//Реалізуйте тип користувача «Студент» з інформацією про ім’я,
//прізвище, вік, назву навчального закладу. Для масиву «Студент»
//реалізуйте наступні запити:
//-Отримати весь масив студентів.
//- Отримати список студентів з прізвищем, яке починається з
//Bro.
//- Отримати список студентів, старших 19 років.
//- Отримати список студентів, старших 20 років і молодших 23
//років.
//- Отримати список студентів, які навчаються в Oxford, і вік
//яких старше 18 років. Результат відсортуйте за віком, за
//спаданням.
//ДОМАШНЄ ЗАВДАННЯ
//2


//Завдання 4:
//Реалізуйте користувацький тип «Фірма». В ньому має бути
//інформація про назву фірми, дату заснування, профіль бізнесу
//(маркетинг, IT, і т. д.), ПІБ директора, кількість працівників,
//адреса.
//Для масиву фірм реалізуйте такі запити:
// Отримати інформацію про всі фірми.
// Отримати фірми, які мають у назві слово «Food».
// Отримати фірми, які працюють у галузі маркетингу.
// Отримати фірми, які працюють у галузі маркетингу або IT.
// Отримати фірми з кількістю працівників більшою, ніж 100.
// Отримати фірми з кількістю працівників у діапазоні від 100 до
//300.
// Отримати фірми, які знаходяться в Лондоні.
// Отримати фірми, в яких прізвище директора White.
// Отримати фірми, які засновані більше двох років тому.
// Отримати фірми з дня заснування яких минуло 123 дні.
// Отримати фірми, в яких прізвище директора Black і мають у
//назві фірми слово «White».


//Завдання 5
//Для масиву цілих чисел реалізуйте користувацьке сортування.
//Сортування має працювати за сумою цифр числа (за зростанням
//та зменшенням). Наприклад, якщо сортування проводиться за
//зменшенням, потрібно повернути числа з максимальною сумою
//в порядку зменшення суми. Наприклад, якщо масив містить 121,
//75, 81, після сортування за зменшенням ми отримаємо 75, 81, 121.
//Такий результат, тому що 7+5 = 12, 8+1 = 9, 1+2+1 = 4


//Завдання 6
//Для двох масивів цілих реалізуйте такі запити:
// Отримати різницю двох масивів (елементи першого масиву,
//яких немає у другому).
// Отримати перетин масивів (спільні елементи для обох масивів).
// Отримати об’єднання масивів (елементи обох масивів без
//дублікатів)
// Отримати вміст першого масиву без повторень.


//Завдання 7:
//Додайте до третього завдання клас, який містить інформацію про
//працівників. Потрібно зберігати такі дані:
// ПІБ співробітника
// Посада
// Контактний телефон
// Email
// Заробітна плата
//Помістіть інформацію про працівників всередину фірми.
//Для масиву співробітників фірми реалізуйте наступні запити:
// Отримати список усіх працівників певної фірми.
// Отримати список усіх працівників певної фірми, в яких
//заробітна плата більша заданої.
//Отримати список працівників усіх фірм, в яких є посада
//«Менеджер».
// Отримати список працівників, в яких телефон починається з 23.
// Отримати усіх працівників, у яких Email починається з «di».
// Отримати список працівників з ім'ям Lionel.