// hw_13.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

void Show(char** arr, int r){
	for (int i = 0; i < r; ++i) {
		cout << i + 1 << ". " << arr[i] << endl;
	}
}

int main()
{
	int r = 4, c = 80;
	char** surnames = new char* [r];
	for (int i = 0; i < r; ++i) {
		surnames[i] = new char[c];
	}


	for (int i = 0; i < r; ++i) {
		cout << "Enter surname num " << i + 1 << ": ";
		cin.getline(surnames[i], c);
	}
	cout << endl;
	Show(surnames, r);

	for (int i = 0; i < r; ++i) {
		for (int o = i + 1; o < r; ++o) {
			if (surnames[i][0] > surnames[o][0]) swap(surnames[i], surnames[o]);
		}
	}
	cout << endl;
	Show(surnames, r);


	cout << endl;
	system("pause");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
